# Chapter 7. Data Cleaning and Preparation
<a id='index'></a>
## Table of Content
- [7.1 Handling Missing Data](#71)
    - [7.1.1 Filtering Out Missing Data](#711)
    - [7.1.2 Filling in Missing Data](#712)
- [7.2 Data Transformation](#72)
    - [7.2.1 Removing Duplicates](#721)
    - [7.2.2 Transforming Data Using a Function or Mapping](#722)
    - [7.2.3 Replacing Values](#723)
    - [7.2.4 Renaming Axis Indexes](#724)
    - [7.2.5 Discretization and Binning](#725)
    - [7.2.6 Detecting and Filtering Outliers](#726)
    - [7.2.7 Permutation and Random Sampling](#727)
    - [7.2.8 Computing Indicator/Dummy Variables](#728)

<hr>

## 7.1 Handling Missing Data
<a id='71'></a>

In [2]:
import numpy as np
import pandas as pd

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

### 7.1.1 Filtering Out Missing Data
<a id='711'></a>

In [6]:
data = pd.Series([1, np.NaN, 3.5, np.NaN, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
# This is equivalent to 
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.NaN, np.NaN],
                     [np.NaN, np.NaN, np.NaN], [np.NaN, 6.5, 3.]])
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data['4'] = np.NaN
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.NaN
df.iloc[:2, 2] = np.NaN
df

          0         1         2
0 -0.863158       NaN       NaN
1  0.808511       NaN       NaN
2 -0.384312       NaN -0.137187
3 -0.529477       NaN  1.345394
4  0.365681 -1.803060 -0.552149
5 -0.841954 -0.007194 -0.194787
6  0.668787 -0.797668 -0.003249

In [19]:
df.dropna()

          0         1         2
4  0.365681 -1.803060 -0.552149
5 -0.841954 -0.007194 -0.194787
6  0.668787 -0.797668 -0.003249

In [20]:
df.dropna(thresh=2)

          0         1         2
2 -0.384312       NaN -0.137187
3 -0.529477       NaN  1.345394
4  0.365681 -1.803060 -0.552149
5 -0.841954 -0.007194 -0.194787
6  0.668787 -0.797668 -0.003249

### 7.1.2 Filling In Missing Data
<a id='712'></a>

In [21]:
df.fillna(0)

          0         1         2
0 -0.863158  0.000000  0.000000
1  0.808511  0.000000  0.000000
2 -0.384312  0.000000 -0.137187
3 -0.529477  0.000000  1.345394
4  0.365681 -1.803060 -0.552149
5 -0.841954 -0.007194 -0.194787
6  0.668787 -0.797668 -0.003249

In [22]:
# Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.863158  0.500000  0.000000
1  0.808511  0.500000  0.000000
2 -0.384312  0.500000 -0.137187
3 -0.529477  0.500000  1.345394
4  0.365681 -1.803060 -0.552149
5 -0.841954 -0.007194 -0.194787
6  0.668787 -0.797668 -0.003249

In [23]:
# fillna returns a new object, but you can modify the existing object in-place
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.863158  0.000000  0.000000
1  0.808511  0.000000  0.000000
2 -0.384312  0.000000 -0.137187
3 -0.529477  0.000000  1.345394
4  0.365681 -1.803060 -0.552149
5 -0.841954 -0.007194 -0.194787
6  0.668787 -0.797668 -0.003249

In [27]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = np.NaN
df.iloc[4:, 2] = np.NaN

In [28]:
df.fillna(method='ffill')

          0         1         2
0  0.381489  1.452364  0.385276
1 -0.814912  1.197299  1.748279
2 -0.567456  1.197299 -2.007605
3  0.863520  1.197299 -0.229765
4 -1.869556  1.197299 -0.229765
5 -1.121451  1.197299 -0.229765

In [29]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.381489  1.452364  0.385276
1 -0.814912  1.197299  1.748279
2 -0.567456  1.197299 -2.007605
3  0.863520  1.197299 -0.229765
4 -1.869556       NaN -0.229765
5 -1.121451       NaN -0.229765

<hr>

## 7.2 Data Transformation
<a id='72'></a>

### 7.2.1 Removing Duplicates
<a id='721'></a>

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [36]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 Transforming Data Using a Function or Mapping
<a id='722'></a>

In [37]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [38]:
# Suppose you wanted to add a column indicating the type of animal that each food came from.
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

lowercased = data['food'].str.lower()
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
# We could also have passed a function that does all the work: 
data['animal2'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

### 7.2.3 Replacing Values
<a id='723'></a>

In [45]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data.replace([-999, -1000], [np.nan, 0])
# data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 Renaming Axis Indexes
<a id='724'></a>

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
transform = lambda x: x[:4].upper()
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [61]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 7.2.5 Discretization and Binning
<a id='725'></a>
Continuous data is often discretized or otherwise separated into “bins” for analysis.

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

# Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
# do so, you have to use cut, a function in pandas
cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see describes the bins computed by pandas.cut. You can treat it like an array of strings indicating the bin name; internally it contains a categories array specifying the dis‐ tinct category names along with a labeling for the ages data in the codes attribute:

In [67]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [68]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [70]:
pd.value_counts(cats)

# a parenthesis means that the side is open, 
# while the square bracket means it is closed (inclusive).

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [71]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [72]:
# You can also pass your own bin names by passing a list or array to the labels option:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will com‐ pute equal-length bins based on the minimum and maximum values in the data.

In [74]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.037, 0.28], (0.52, 0.76], (0.52, 0.76], (0.037, 0.28], (0.52, 0.76], ..., (0.28, 0.52], (0.28, 0.52], (0.76, 1.0], (0.76, 1.0], (0.76, 1.0]]
Length: 20
Categories (4, interval[float64]): [(0.037, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

In [84]:
pd.cut(data, 4, precision=2).categories

IntervalIndex([(0.037, 0.28], (0.28, 0.52], (0.52, 0.76], (0.76, 1.0]]
              closed='right',
              dtype='interval[float64]')

In [86]:
pd.value_counts(pd.cut(data, 4, precision=2))

(0.76, 1.0]      7
(0.037, 0.28]    5
(0.52, 0.76]     4
(0.28, 0.52]     4
dtype: int64

In [81]:
# qcut, bins the data based on sample quantiles. Depending on the distribution of the data
pd.qcut(data, 4) # Cut into quartiles

[(0.0367, 0.283], (0.581, 0.826], (0.581, 0.826], (0.0367, 0.283], (0.581, 0.826], ..., (0.283, 0.581], (0.283, 0.581], (0.826, 0.998], (0.581, 0.826], (0.826, 0.998]]
Length: 20
Categories (4, interval[float64]): [(0.0367, 0.283] < (0.283, 0.581] < (0.581, 0.826] < (0.826, 0.998]]

In [82]:
pd.value_counts(pd.qcut(data, 4))

(0.826, 0.998]     5
(0.581, 0.826]     5
(0.283, 0.581]     5
(0.0367, 0.283]    5
dtype: int64

### 7.2.6 Detecting and Filtering Outliers
<a id='726'></a>

In [87]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.067706    -0.026893     0.001453    -0.039725
std       1.036467     0.977972     0.957142     0.987821
min      -3.060415    -2.986550    -2.989101    -3.026414
25%      -0.616609    -0.749765    -0.619510    -0.711063
50%       0.051817     0.028782    -0.020328    -0.031925
75%       0.774302     0.632359     0.635871     0.661604
max       3.567747     2.886562     2.870863     3.242423

In [90]:
col = data[2]
col[np.abs(col) > 2.5]

40    -2.630778
102   -2.869211
193    2.713197
255    2.666452
301    2.870863
555    2.515280
584   -2.511245
767   -2.989101
926   -2.814411
Name: 2, dtype: float64

In [110]:
# pd.DataFrame.any?
data[(np.abs(data) > 1).all(1)]

            0         1         2         3
83   1.430658  1.031317  1.350561  1.524126
109 -2.633844 -1.009188  1.301234 -1.228649
176  1.537566  1.082555  1.429509  1.275105
184  1.306933 -2.332045  1.293842 -1.050016
280 -1.013551  2.431113  1.495919 -1.941170
315 -1.566047  2.040913  1.558822 -1.954648
338  1.398507  1.790142  1.196328  1.206085
569 -3.060415 -1.284500  2.346600  1.153049
629  3.567747 -1.179289  1.855735 -1.172113
747  1.303339 -2.624658 -2.217977 -1.141325
783 -1.648556  1.234052  1.103260  1.563731

In [112]:
# Values can be set based on these criteria. Here is code to cap values outside the inter‐ val –3 to 3:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.067015    -0.026893     0.001453    -0.039941
std       1.033574     0.977972     0.957142     0.986965
min      -3.000000    -2.986550    -2.989101    -3.000000
25%      -0.616609    -0.749765    -0.619510    -0.711063
50%       0.051817     0.028782    -0.020328    -0.031925
75%       0.774302     0.632359     0.635871     0.661604
max       3.000000     2.886562     2.870863     3.000000

In [114]:
# The statement np.sign(data) produces 1 and –1 values based on whether the values in data are positive or negative:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0 -1.0 -1.0  1.0

### 7.2.7 Permutation and Random Sampling
<a id='727'></a>
Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering:

In [120]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [121]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [122]:
sampler = np.random.permutation(5)
sampler

array([1, 4, 3, 2, 0])

In [124]:
# That array can then be used in iloc-based indexing or the equivalent take function:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [126]:
# To select a random subset without replacement, you can use the sample method on Series and DataFrame:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [129]:
# To generate a sample with replacement (to allow repeat choices), pass replace=True to sample:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
0    5
4    4
1    7
1    7
3    6
0    5
2   -1
4    4
4    4
dtype: int64

### 7.2.8 Computing Indicator/Dummy Variables
<a id='728'></a>
Another type of transformation for statistical modeling or machine learning applica‐ tions is converting a categorical variable into a “dummy” or “indicator” matrix. If a column in a DataFrame has k distinct values, you would derive a matrix or Data‐ Frame with k columns containing all 1s and 0s by using pd.get_dummies(df['key'])

In [137]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [138]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [135]:
# You may want to add a prefix to the columns in the indicator DataFrame, 
# which can then be merged with the other data. get_dummies has a prefix argu‐ ment for doing this:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummies = df[['data1']].join(dummies)
df_with_dummies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',

<hr>

[Back to top](#index)